app/views/families/index.html.erb

        <td><%= link_to family.address, family %></td>
        <td><%= family.children.count %></td>
---
SELECT COUNT(*) FROM "children"  WHERE "children"."family_id" = $1  [["family_id", 1]]