app/views/play_networks/_form.html.erb

  <tbody>
    <% @play_network.play_nodes.each do |play_node| %>
---
SELECT "play_nodes".* FROM "play_nodes"  WHERE "play_nodes"."play_network_id" = $1  [["play_network_id", 1]]