app/controllers/families_controller.rb

  def create
    @family = Family.new(family_params)

    respond_to do |format|
      if @family.save
---
INSERT INTO "families" ("address", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", "Malaysia"], ["created_at", "2015-03-23 20:30:08.316861"], ["name", "Sutan"], ["updated_at", "2015-03-23 20:30:08.316861"]]

  def destroy
    if @family.can_be_destroyed?
      @family.destroy
---
DELETE FROM "families" WHERE "families"."id" = $1  [["id", 1]]

    def set_family
      @family = Family.find(params[:id])
---
SELECT  "families".* FROM "families"  WHERE "families"."id" = $1 LIMIT 1  [["id", 1]]