app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages"   ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def index
    if current_user.admin?
      @messages = Message.all.order('id DESC').paginate(:page => @page,:per_page => @per_page)