app/controllers/play_networks_controller.rb

  def index
    if current_user.admin?
      @play_networks = PlayNetwork.all
---
SELECT "play_networks".* FROM "play_networks"

  def create
    @play_network = PlayNetwork.new(play_network_params)

    respond_to do |format|
      if @play_network.save
---
INSERT INTO "play_networks" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-03-25 15:18:06.575094"], ["name", "Olmsted Terrace"], ["updated_at", "2015-03-25 15:18:06.575094"]]

    def set_play_network
      @play_network = PlayNetwork.find(params[:id])
---
SELECT  "play_networks".* FROM "play_networks"  WHERE "play_networks"."id" = $1 LIMIT 1  [["id", 1]]