app/controllers/play_nodes_controller.rb

INSERT INTO "play_nodes" ("child_id", "created_at", "play_network_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["child_id", 1], ["created_at", "2015-03-25 15:18:19.845559"], ["play_network_id", 1], ["updated_at", "2015-03-25 15:18:19.845559"]]
---
  def create
    @play_node = PlayNode.new(play_node_params)

    respond_to do |format|
      if @play_node.save